In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
!cat examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [3]:
df = pd.read_csv('examples/ex1.csv')

In [4]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
!cat examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [6]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [7]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
names = ['a', 'b', 'c', 'd', 'message']

In [9]:
pd.read_csv('examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [10]:
!cat examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [11]:
parsed = pd.read_csv('examples/csv_mindex.csv',
                    index_col=['key1', 'key2'])

In [12]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [14]:
!cat examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [13]:
pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [15]:
!cat examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [16]:
result = pd.read_csv('examples/ex5.csv')

In [17]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [23]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [26]:
result = pd.read_csv('examples/ex5.csv', na_values=['one'])

In [27]:
result

  something  a   b     c   d message
0       NaN  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [28]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [29]:
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

## Some read_csv/read_table function arguments
|Argument|Description|
|---|---|
|path|String indicating filesystem location, URL, or file-like object|
|sep or delimiter|Character sequence or regular expression to use to split fields in each row|
|header|Row number to use as column names; defaults to 0 (first row), but should be None if there is no header row|
|index_col|Column numbers or names to use as the row index in the result; can be a single name/number or a list of them for a hierarchical index|
|names|List of column names for result, combine with header=None|
|skiprows|Number of rows at beginning of file to ignore or list of row numbers (starting from 0) to skip.|
|na_values|Sequence of values to replace with NA.|
|comment|Character(s) to split comments off the end of lines.|
|parse_dates|Attempt to parse data to datetime; False by default. If True, will attempt to parse all columns. Otherwise can specify a list of column numbers or name to parse. If element of list is tuple or list, will combine multiple columns together and parse to date (e.g., if date/time split across two columns).|
|keep_date_col|If joining columns to parse date, keep the joined columns; False by default.|
|converters|Dict containing column number of name mapping to functions (e.g., {'foo': f} would apply the function f to all values in the 'foo' column).|
|dayfirst|When parsing potentially ambiguous dates, treat as international format (e.g., 7/6/2012 -> June 7, 2012); False by default.|
|date_parser|Function to use to parse dates.|
|nrows|Number of rows to read from beginning of file.|
|iterator|Return a TextParser object for reading file piecemeal.|
|chunksize|For iteration, size of file chunks.|
|skip_footer|Number of lines to ignore at end of file.|
|verbose|Print various parser output information, like the number of missing values placed in non-numeric columns.|
|encoding|Text encoding for Unicode (e.g., 'utf-8' for UTF-8 encoded text).|
|squeeze|If the parsed data only contains one column, return a Series.|
|thousands|Separator for thousands (e.g., ',' or '.').|

## Reading Text Files in Pieces
When processing very large files or figuring out the right set of arguments to correctly process a large file, you may only want to read in a small piece of a file or iterate through smaller chunks of the file.

Before we look at a large file, we make the pandas display settings more compact:

In [2]:
pd.options.display.max_rows = 10

In [3]:
data = pd.read_csv('examples/ex5.csv')

In [4]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [6]:
data.to_csv('examples/out.csv')

In [7]:
!cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [8]:
import sys

In [11]:
data.to_csv(sys.stdout, sep ='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [12]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [13]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [15]:
data = pd.date_range('1/1/2000',periods=7)

In [18]:
ts = pd.Series(np.arange(7), index=data)

In [19]:
ts.to_csv('examples/tseries.csv')

/home/viewv/anaconda3/envs/DeepLearning/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """Entry point for launching an IPython kernel.

In [20]:
!cat examples/tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [21]:
!cat examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [22]:
import csv

In [24]:
with open('examples/ex7.csv') as f:
    reader = csv.reader(f)
    lines = list(csv.reader(f))
    header, values = line[0],line[1:]
    data_dict = {h: v for h,v in zip(header,zip(*values))}
    print(data_dict)

{'1': ('2', '3')}

In [25]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [26]:
import json

In [27]:
result = json.loads(obj)

In [28]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [32]:
with open('examples/ep.json','w') as f:
    asjson = json.dump(result,fp=f)

In [33]:
!cat examples/ep.json

{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}

In [34]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [35]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [36]:
data = pd.read_json('examples/example.json')

In [37]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [38]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [39]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

## XML and HTML: Web Scraping
Python has many libraries for reading and writing data in the ubiquitous HTML and XML formats. Examples include lxml, Beautiful Soup, and html5lib. While lxml is comparatively much faster in general, the other libraries can better handle malformed HTML or XML files.

pandas has a built-in function, read_html, which uses libraries like lxml and Beautiful Soup to automatically parse tables out of HTML files as DataFrame objects. To show how this works, I downloaded an HTML file (used in the pandas documentation) from the United States FDIC government agency showing bank failures. First, you must install some additional libraries used by read_html:

In [40]:
tables = pd.read_html('examples/ep.html')

In [41]:
tables

[          Function                                        Description
 0         read_csv  Load delimited data from a file, URL, or file-...
 1       read_table  Load delimited data from a file, URL, or file-...
 2         read_fwf  Read data in fixed-width column format (i.e., ...
 3   read_clipboard  Version of read_table  that reads data from th...
 4       read_excel   Read tabular data from an Excel XLS or XLSX file
 ..             ...                                                ...
 9      read_pickle  Read an arbitrary object stored in Python pick...
 10        read_sas  Read a SAS dataset stored in one of the SAS sy...
 11        read_sql  Read the results of a SQL query (using SQLAlch...
 12      read_stata              Read a dataset from Stata file format
 13    read_feather                Read the Feather binary file format

 [14 rows x 2 columns],
             Argument                                        Description
 0               path  String indicating filesystem location, URL, or...
 1   sep or delimiter  Character sequence or regular expression to us...
 2             header  Row number to use as column names; defaults to...
 3          index_col  Column numbers or names to use as the row inde...
 4              names  List of column names for result, combine with ...
 ..               ...                                                ...
 16       skip_footer          Number of lines to ignore at end of file.
 17           verbose  Print various parser output information, like ...
 18          encoding  Text encoding for Unicode (e.g., 'utf-8' for U...
 19           squeeze  If the parsed data only contains one column, r...
 20         thousands        Separator for thousands (e.g., ',' or '.').

 [21 rows x 2 columns],
            Argument                                        Description
 0         delimiter  One-character string to separate fields; defau...
 1    lineterminator  Line terminator for writing; defaults to '\r\n...
 2         quotechar  Quote character for fields with special charac...
 3           quoting  Quoting convention. Options include csv.QUOTE_...
 4  skipinitialspace  Ignore whitespace after each delimiter; defaul...
 5       doublequote  How to handle quoting character inside a field...
 6        escapechar  String to escape the delimiter if quoting is s...]

In [42]:
len(tables)

3

In [49]:
failures = tables[2]

In [50]:
failures.head()

           Argument                                        Description
0         delimiter  One-character string to separate fields; defau...
1    lineterminator  Line terminator for writing; defaults to '\r\n...
2         quotechar  Quote character for fields with special charac...
3           quoting  Quoting convention. Options include csv.QUOTE_...
4  skipinitialspace  Ignore whitespace after each delimiter; defaul...

In [52]:
from lxml import objectify

In [53]:
frame = pd.read_csv('examples/ex1.csv')

In [54]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [55]:
frame.to_pickle('examples/frame_pickle')

In [56]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [64]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [65]:
store = pd.HDFStore('mydata.h5')

In [66]:
store['obj1'] = frame

In [67]:
store['obj1_col'] = frame['a']

In [68]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [69]:
frame

           a
0  -0.404184
1   0.101377
2  -0.864337
3  -1.203313
4   1.170107
..       ...
95 -0.383669
96 -0.011883
97 -0.336987
98  1.231818
99  0.567347

[100 rows x 1 columns]

In [70]:
store['obj1']

           a
0  -0.404184
1   0.101377
2  -0.864337
3  -1.203313
4   1.170107
..       ...
95 -0.383669
96 -0.011883
97 -0.336987
98  1.231818
99  0.567347

[100 rows x 1 columns]

In [72]:
store.put('obj2', frame, format='table')

In [73]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10  1.261995
11 -1.036488
12  0.638882
13  1.723655
14 -0.567668
15  0.339448

In [74]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [76]:
import requests
!export http_proxy="http://127.0.0.1:12333"
!export https_proxy="http://127.0.0.1:12333"

In [77]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [78]:
resp = requests.get(url)

In [79]:
resp

In [80]:
data = resp.json()

In [83]:
data[0]['title']

'BUG: Series.__setitem__ with datetimetz data'

In [84]:
issues = pd.DataFrame(data, columns=['number','title','labels','state'])

In [87]:
issues.head(10)

,number,title,labels,state
0,25331,BUG: Series.__setitem__ with datetimetz data,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
1,25330,MultiIndex Support for DataFrame.pivot,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
2,25329,"Fix+test #25282, #25317","[{'id': 32815646, 'node_id': 'MDU6TGFiZWwzMjgx...",open
3,25328,DOC: Improvement docstring of DataFrame.rank(),"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
4,25327,#14873: test for groupby.agg coercing booleans,"[{'id': 31404521, 'node_id': 'MDU6TGFiZWwzMTQw...",open
5,25326,Inconsistent dtype metadata leads to wrong Par...,[],open
6,25324,Fix validation error type `GL01` and check in CI,[],open
7,25322,pandas 0.24.1 testsuite failure with new numpy (,[],open
8,25320,fix the function `find_common_types` bug,"[{'id': 57296398, 'node_id': 'MDU6TGFiZWw1NzI5...",open
9,25318,"pd.Categorical(Series, categories=..) returns ...",[],open

In [88]:
import sqlite3

In [89]:
query = """
create table test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);
"""

In [90]:
con = sqlite3.connect('mydata.sqlite')

In [91]:
con.execute(query)

In [92]:
con.commit()

In [93]:
data = [('Atlanta', 'Georgia', 1.25, 6),
       ('Tallahassee', 'Florida', 2.6, 3),
       ('Sacramento', 'California', 1.7, 5)]

In [94]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [95]:
con.executemany(stmt, data)

In [96]:
con.commit()

In [97]:
cursor = con.execute('select * from test')

In [98]:
row = cursor.fetchall()

In [100]:
row

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [101]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [103]:
pd.DataFrame(row, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5